{
  "sectionTitle": "Work Experience",
  "entries": [
    {
      "period": "Aug. 2025 – Present",
      "outcomes": [
        "Standardized onboarding/offboarding protocols and automated account/device provisioning for day-one readiness while improving SaaS procurement and license spend control.",
        "Architected high-availability SME infrastructure with Cisco Catalyst switching, VLAN segmentation, inter-VLAN routing, VMware virtualization, and Active Directory governance.",
        "Directed system hardening, firmware updates, and access-control baselines across physical and virtual environments, sustaining 99.9% service availability.",
        "Resolved complex network and systems incidents through CLI diagnostics and root-cause analysis, addressing subnet conflicts, firewall restrictions, and DHCP scope reallocations.",
        "Produced technical runbooks, process maps, and PowerShell/Bash automation for standardized rebuilds, reducing manual configuration effort by an estimated 40%.",
        "Applied AI-assisted diagnostics with Git/GitHub CI/CD workflows to accelerate analysis, script drafting, and data-informed modernization planning."
      ],
      "backgroundImage": "/img/CN-tower-view-downtown-Toronto-event.png",
      "location": "North York, ON",
      "focus": "Delivering resilient SME infrastructure, secure identity workflows, and automation-led operations with documented controls, incident response discipline, and measurable service reliability.",
      "logLine": "ops sync: 99.9% uptime • rebuild time down 40%",
      "title": "IT Systems & Network Consultant (Independent)",
      "company": "Self-Employed",
      "insetImage": "/img/at-Microsoft-downtown-Toronto-event.png"
    },
    {
      "period": "Jan. 2024 - Aug. 2025",
      "outcomes": [
        "Supported 250+ students with hands-on lab guidance across laptops, desktops, tests, and project sessions.",
        "Built and maintained Windows Server/Windows client virtual labs in VirtualBox/VMware, including Active Directory setups.",
        "Installed and troubleshot course tooling (VS Code, Eclipse, MySQL, Python/HTML/CSS/JS environments).",
        "Ran networking practicals covering VLAN basics, cabling, and connectivity troubleshooting, documenting repeatable lab setups.",
        "Processed results and verified student records through Google Classroom workflows."
      ],
      "backgroundImage": "https://static.photos/technology/1600x900/19",
      "location": "Scarborough, ON",
      "focus": "Delivered hands-on instruction while managing lab environments, software installations, and networking practicals for 250+ students.",
      "logLine": "lab sync: 250 endpoints • auth OK • deployment stable",
      "title": "Computer IT Instructor (Computer Science & Applied Computing)",
      "company": "Pures College of Technology",
      "insetImage": "img/Pures-College-classroom.jpg"
    },
    {
      "period": "Mar. 2017 - Aug. 2023",
      "outcomes": [
        "Led and administered the academic ERP ecosystem (admissions, examinations, reporting, identity, RBAC) for 4,000+ users as sole technical authority to leadership.",
        "Modernized data workflows, reducing result processing from 3–5 days to same-day and reclaiming 200+ hours annually through Python, SQL, ETL, and validation controls.",
        "Governed onboarding/offboarding for 4,000+ stakeholders by integrating Active Directory and role-based access controls for secure, immediate departmental access.",
        "Architected integrations between ERP modules and core infrastructure, keeping 4,000+ user profiles synchronized across admissions, examination, and reporting pipelines.",
        "Delivered advanced technical support for software, authentication, and hardware incidents (remote and onsite), minimizing downtime during high-volume academic cycles.",
        "Oversaw secure examination technologies, running readiness checks and biometric verification workflows for 300+ candidates per session across multiple annual cycles."
      ],
      "backgroundImage": "https://static.photos/technology/1600x900/45",
      "location": "Nigeria",
      "focus": "Led enterprise academic ERP operations and data automation for 4,000+ users, combining secure identity governance, cross-system integration, and high-volume examination reliability.",
      "logLine": "erp ops: 4,000+ identities synced • same-day results active",
      "title": "Systems & Data Analyst / System Programmer",
      "company": "Federal University of Technology, Akure (FUTA) - Centre for Continuing Education (CCE)",
      "insetImage": "img/data-analysis-mtd.jpg"
    },
    {
      "period": "Dec. 2014 - Aug. 2015",
      "outcomes": [
        "Delivered foundational computer science instruction focused on logical reasoning and problem-solving.",
        "Reviewed and assessed student work to ensure understanding and accuracy."
      ],
      "backgroundImage": "https://static.photos/technology/1600x900/102",
      "location": "Nigeria",
      "focus": "Delivered foundational computer science instruction with emphasis on logical reasoning and structured problem solving.",
      "logLine": "curriculum boot: logic module deployed • comprehension 93%",
      "title": "Computer Science (ICT) Teacher",
      "company": "Community Secondary School, Agulu-Awka",
      "insetImage": "img/Teaching-Students-Anambra.jpg"
    }
  ]
}
