{
  "projects": [
    {
      "details": [
        "Consolidated fragmented results data from admissions portals, business application records, examination datasets, and departmental grade submissions into a unified reporting layer, applying SQL-driven validation checks before official publication.",
        "Designed interactive KPI panels in Power BI with drill-down capabilities across student cohorts, academic sessions, and departments, enabling leadership to monitor processing timelines, flag anomaly rates in real-time, and compare performance trends across admission intakes.",
        "Developed automated data quality flags using conditional logic and formula-driven validation in Excel and Google Sheets, reducing the manual effort required to identify outliers and formatting inconsistencies across thousands of records each cycle.",
        "Delivered export-ready dashboards and audit-trail reports formatted for leadership reviews, accreditation audits, and departmental briefings, directly supporting executive planning decisions and resource allocation across academic programs.",
        "Work Context: At FUTA (Systems & Data Analyst / System Programmer, 2017–2023), this validation workflow protected admissions/results reporting accuracy before publication. Current Implementation: I now maintain the same quality checks in personal GitHub assets (`scripts/sql/mysql/mysql_validate_results_integrity.sql`, `scripts/sql/postgres/postgres_validate_results_integrity.sql`, and `powerbi/powerquery/powerquery_data_quality_template.pq`) so each dashboard refresh starts with repeatable controls."
      ],
      "impact": [
        {
          "value": "4,000+",
          "label": "Records audited",
          "detail": "Admissions, exams, and results cycles"
        },
        {
          "value": "35%",
          "label": "Faster reconciliation",
          "detail": "Automation reduced manual review time"
        },
        {
          "value": "3",
          "label": "Leadership dashboards",
          "detail": "Power BI, Excel, Sheets"
        }
      ],
      "summary": "Built a Power BI and Excel analytics suite to centralize results processing, anomaly detection, and cohort performance analysis across multiple admissions and examination cycles serving 4,000+ students.",
      "mobileSummary": "Built a Power BI and Excel analytics suite that centralized results processing and anomaly tracking for 4,000+ students.",
      "modified": "2026-01-31T14:45:00.000Z",
      "featured": true,
      "title": "Academic Results Analytics Dashboard",
      "tags": [
        "Power BI",
        "Excel",
        "SQL",
        "Business Applications",
        "Data Validation",
        "Reporting",
        "Scripted QA"
      ],
      "link": "docs/case-studies/academic-results-analytics-dashboard.md",
      "linkText": "View Case Summary (Markdown)",
      "pdf": "docs/case-studies/academic-results-analytics-dashboard.pdf",
      "id": "academic-results-analytics-dashboard",
      "image": "https://images.unsplash.com/photo-1460925895917-afdab827c52f?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "data",
      "posted": "2026-01-15T09:20:00.000Z"
    },
    {
      "details": [
        "Designed and implemented spreadsheet-based validation workflows using advanced lookup formulas, deduplication rules, and eligibility logic to systematically cross-reference applicant submissions against institutional admission criteria, flagging inconsistencies in identity documents, qualification records, and program eligibility.",
        "Leveraged the institution's Gradent platform, institutional exports, and Excel/Google Sheets to reconcile discrepancies between portal submissions and backend records for clean admissions rosters.",
        "Built variance summary reports and sign-off documentation packets that provided department heads with clear visibility into correction actions taken, residual error rates, and data quality metrics, supporting transparent and accountable admissions decisions.",
        "Established repeatable audit procedures that standardized how incoming applicant data was reviewed across multiple intake cycles, reducing manual re-checking and improving turnaround time for final admissions roster publication.",
        "Work Context: In my FUTA role (Systems & Data Analyst / System Programmer, 2017–2023), this audit pattern verified admissions rosters before committee sign-off each intake cycle. Current Implementation: I now run the same rules through personal assets (`scripts/python/data_quality/config_rules_validator.py` and `data/sample/validation_rules.json`) so field completeness, score thresholds, and eligibility logic stay consistent."
      ],
      "impact": [
        {
          "value": "2,000+",
          "label": "Applicants reviewed",
          "detail": "Multi-intake audits"
        },
        {
          "value": "0.8%",
          "label": "Residual error rate",
          "detail": "After cleanup and verification"
        },
        {
          "value": "4",
          "label": "Validation rule sets",
          "detail": "ID, eligibility, duplicates, missing fields"
        }
      ],
      "summary": "Conducted systematic audits of multi-intake admissions datasets at a federal university, reconciling applicant records across identity fields, eligibility criteria, and enrollment status for 2,000+ applicants per cycle.",
      "mobileSummary": "Audited admissions data to reconcile identity, eligibility, and enrollment records for 2,000+ applicants per cycle.",
      "modified": "2025-12-18T14:30:00.000Z",
      "featured": false,
      "title": "Admissions Data Quality Audit",
      "tags": [
        "Excel",
        "Google Sheets",
        "SQL",
        "Admissions Systems",
        "Data Validation",
        "Admissions Audit",
        "Rules Engine"
      ],
      "link": "docs/case-studies/admissions-data-quality-audit.md",
      "linkText": "View Case Summary (Markdown)",
      "pdf": "docs/case-studies/admissions-data-quality-audit.pdf",
      "id": "admissions-data-quality-audit",
      "image": "https://images.unsplash.com/photo-1454165205744-3b78555e5572?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "data",
      "posted": "2025-12-05T08:10:00.000Z"
    },
    {
      "details": [
        "Configured trunk ports, access ports, and inter-VLAN routing scenarios on managed switches to create isolated network segments, simulating enterprise LAN environments where different departments or services operate on dedicated VLANs with controlled inter-segment communication.",
        "Developed structured IP addressing plans covering subnetting, CIDR notation, and address allocation strategies for multiple VLAN segments, documenting each scheme to mirror production-grade network planning methodologies used in enterprise environments.",
        "Created repeatable lab scenarios covering trunking configuration, VLAN assignment, static and dynamic routing integration, and basic failover testing, providing a consistent practice environment for validating networking concepts and troubleshooting common connectivity issues.",
        "Used Cisco Packet Tracer alongside physical equipment and a Cisco network switch to bridge simulation with real-world configuration experience, reinforcing concepts such as switch port security, VLAN pruning, and spanning tree behavior in a controlled lab setting.",
        "Work Context: At Pures College (Computer IT Instructor, 2024–2025), I used this VLAN and addressing workflow to coach students through practical troubleshooting in structured lab sessions. Current Implementation: I continue extending the same scenarios in my personal home lab for repeatable segmentation, routing, and failover testing."
      ],
      "impact": [
        {
          "value": "6",
          "label": "VLAN segments",
          "detail": "Isolated lab services"
        },
        {
          "value": "20+",
          "label": "Endpoints simulated",
          "detail": "Clients and lab servers"
        },
        {
          "value": "4",
          "label": "Lab scenarios",
          "detail": "Trunking, routing, addressing, failover"
        }
      ],
      "summary": "Built and maintained a hands-on networking lab environment using enterprise-grade switching equipment and Cisco Packet Tracer to practice VLAN segmentation, IP addressing schemes, and structured network troubleshooting aligned with Cisco networking fundamentals.",
      "mobileSummary": "Created a hands-on networking lab with enterprise switches and Cisco Packet Tracer to practice VLAN segmentation, IP addressing plans, and structured troubleshooting.",
      "modified": "2025-10-04T05:25:37.056Z",
      "featured": false,
      "title": "VLAN & IP Addressing Lab",
      "tags": [
        "VLAN",
        "TCP/IP",
        "IP Addressing",
        "Switching",
        "Routing"
      ],
      "link": "docs/case-studies/vlan-ip-addressing-lab.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "vlan-ip-addressing-lab",
      "image": "/img/Enterprise-LAN-Simulation.png",
      "category": "networking",
      "posted": "2025-10-04T01:04:57.056Z"
    },
    {
      "details": [
        "Built and executed a structured Cisco Catalyst 3850 troubleshooting lab using two endpoints, console access, and switched Ethernet links to validate baseline reachability, segmented VLAN behavior, and DHCP lease handling under real hardware conditions.",
        "Diagnosed end-to-end connectivity blockers by validating host firewall policy, adapter sharing behavior, VLAN interface addressing, and SVI activation state, then applying targeted corrective changes with command-level verification after each fix.",
        "Documented each issue as an evidence-backed troubleshooting record, preserving screenshots, observed symptoms, root causes, commands used, and validation outcomes so the lab can be replayed as a repeatable networking operations reference.",
        "Work Context: At Pures College (Computer IT Instructor, 2024–2025), I used this same troubleshooting workflow to coach students through practical switch diagnostics and stepwise fault isolation. Current Implementation: I now run and document the same process in my personal home lab and publish the artifacts in the networking-labs GitHub repository for ongoing project continuity."
      ],
      "impact": [
        {
          "value": "5",
          "label": "Issues resolved",
          "detail": "Connectivity, subnet, VLAN, and DHCP fixes"
        },
        {
          "value": "9",
          "label": "Evidence screenshots",
          "detail": "Extracted from troubleshooting log"
        },
        {
          "value": "3",
          "label": "Physical devices",
          "detail": "Catalyst switch and two endpoints"
        }
      ],
      "summary": "Completed a hands-on Cisco Catalyst 3850 troubleshooting lab and resolved five real network issues across ICMP reachability, NIC sharing, VLAN subnet alignment, SVI state, and DHCP binding conflicts with screenshot-backed evidence.",
      "mobileSummary": "Resolved five Cisco Catalyst 3850 lab issues across reachability, VLAN routing, and DHCP with screenshot-backed evidence.",
      "modified": "2026-02-25T20:15:00.000Z",
      "featured": true,
      "title": "Cisco Catalyst 3850 Troubleshooting Lab (Phase 1)",
      "tags": [
        "Cisco Catalyst 3850",
        "Switch Troubleshooting",
        "VLAN",
        "DHCP",
        "ICMP",
        "Documentation"
      ],
      "link": "https://github.com/toughdave/networking-labs#readme",
      "linkText": "View GitHub Repository README",
      "id": "cisco-catalyst-3850-troubleshooting-phase-1",
      "image": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-01.png",
      "images": [
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-01.png",
          "alt": "Issue 1 troubleshooting screenshot from Cisco Catalyst 3850 lab",
          "caption": "Issue 1 evidence: ICMP/firewall troubleshooting and reachability checks.",
          "afterDetail": 0
        },
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-02.png",
          "alt": "Issue 2 troubleshooting screenshot showing temporary internet sharing setup",
          "caption": "Issue 2 evidence: temporary internet sharing path through desktop NIC.",
          "afterDetail": 1
        },
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-03.png",
          "alt": "Issue 3 troubleshooting screenshot showing VLAN interface subnet alignment",
          "caption": "Issue 3 evidence: VLAN 1 subnet realignment to active segment.",
          "afterDetail": 1
        },
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-04.png",
          "alt": "Issue 4 troubleshooting screenshot showing VLAN 30 state correction",
          "caption": "Issue 4 evidence: VLAN 30 interface corrected with no shutdown.",
          "afterDetail": 2
        },
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-05.png",
          "alt": "Issue 5 troubleshooting screenshot showing DHCP conflict handling",
          "caption": "Issue 5 evidence: DHCP binding and reservation conflict cleanup.",
          "afterDetail": 2
        },
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-06.png",
          "alt": "Additional troubleshooting screenshot 6 from Cisco Catalyst 3850 lab",
          "caption": "Additional lab evidence screenshot 6.",
          "afterDetail": 2
        },
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-07.png",
          "alt": "Additional troubleshooting screenshot 7 from Cisco Catalyst 3850 lab",
          "caption": "Additional lab evidence screenshot 7.",
          "afterDetail": 2
        },
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-08.png",
          "alt": "Additional troubleshooting screenshot 8 from Cisco Catalyst 3850 lab",
          "caption": "Additional lab evidence screenshot 8.",
          "afterDetail": 2
        },
        {
          "src": "/img/networking/cisco-catalyst-3850-troubleshooting-phase-1/issue-09.png",
          "alt": "Additional troubleshooting screenshot 9 from Cisco Catalyst 3850 lab",
          "caption": "Additional lab evidence screenshot 9.",
          "afterDetail": 2
        }
      ],
      "category": "networking",
      "posted": "2026-02-25T20:00:00.000Z"
    },
    {
      "details": [
        "Built baseline virtual machine images for Windows Server 2019/2022 and Windows 10/11 client systems in both Oracle VirtualBox and VMware Workstation Pro, pre-configuring Active Directory Domain Services, DNS, Group Policy, and identity lab baselines.",
        "Developed comprehensive setup playbooks and reset procedures to maintain consistency across 250+ student lab seats, enabling rapid redeployment of clean environments between terms and ensuring every student worked with identical baseline configurations regardless of their host machine.",
        "Guided students through the complete lifecycle of domain controller deployment — from server role installation and domain creation through user/group management, Organizational Unit structuring, Group Policy configuration, and cloud-connected identity concepts.",
        "Documented repeatable onboarding procedures covering hypervisor installation, virtual network adapter configuration, shared folder setup, and snapshot management, reducing first-week setup failures and allowing instructional time to focus on core systems administration concepts.",
        "Work Context: At Pures College (Computer IT Instructor, 2024–2025), these standardized virtual lab builds supported classroom systems administration practicals with AD and Azure identity. Current Implementation: I continue refining the same baseline images and reset playbooks in personal projects for repeatable identity and policy testing."
      ],
      "impact": [
        {
          "value": "250+",
          "label": "Lab seats",
          "detail": "Student environments"
        },
        {
          "value": "3",
          "label": "Core services",
          "detail": "AD, DNS, Group Policy"
        },
        {
          "value": "2",
          "label": "Virtualization stacks",
          "detail": "VirtualBox and VMware"
        }
      ],
      "summary": "Provisioned and maintained standardized Windows Server and Active Directory lab environments across VirtualBox and VMware for 250+ students over multiple academic terms.",
      "mobileSummary": "Provisioned standardized Windows Server and Active Directory labs in VirtualBox/VMware for 250+ students.",
      "modified": "2025-10-02T07:51:09.056Z",
      "featured": true,
      "title": "Virtual Lab Deployment & Active Directory",
      "tags": [
        "Windows Server",
        "Active Directory",
        "Identity & Access",
        "Group Policy",
        "VirtualBox/VMware",
        "Lab Deployment"
      ],
      "link": "docs/case-studies/virtual-lab-deployment-active-directory.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "virtual-lab-deployment-active-directory",
      "image": "https://images.unsplash.com/photo-1600267185393-e158a98703de?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "systems",
      "posted": "2025-10-02T07:51:09.056Z"
    },
    {
      "details": [
        "Coordinated end-to-end device readiness for examination periods, including the setup, calibration, and testing of biometric fingerprint verification devices used to authenticate student identities before entry into examination halls, achieving About 98% verification compliance rates across multiple terms.",
        "Established CCTV monitoring workflows with systematic incident logging procedures, ensuring continuous visual documentation of examination proceedings and creating a reliable chain-of-custody for recorded footage used in post-exam reviews and misconduct investigations.",
        "Developed standardized incident documentation templates and escalation procedures aligned with institutional compliance standards, enabling invigilators and support staff to consistently capture and report irregularities with the detail required for disciplinary and audit processes.",
        "Maintained comprehensive audit trails linking biometric verification records, surveillance footage timestamps, and incident reports to individual examination sessions, providing institutional leadership with transparent records for compliance reporting and policy review.",
        "Work Context: At FUTA (Systems & Data Analyst / System Programmer, 2017–2023), this integrity workflow supported high-stakes exam operations with biometric checks, CCTV monitoring, and incident logging. Current Implementation: I now maintain the same control flow as checklist-driven templates in personal operations projects for readiness drills and audit reporting."
      ],
      "impact": [
        {
          "value": "98%",
          "label": "Verification compliance",
          "detail": "Biometric and CCTV checks"
        },
        {
          "value": "12+",
          "label": "Exam cycles",
          "detail": "Multi-term coverage"
        },
        {
          "value": "0",
          "label": "Critical gaps",
          "detail": "Incident handling standards"
        }
      ],
      "summary": "Designed and implemented a multi-layered examination integrity monitoring workflow at a federal university, integrating biometric identity verification, CCTV-based monitoring records, and structured incident reporting procedures to strengthen compliance and audit readiness across 12+ high-stakes examination cycles.",
      "mobileSummary": "Implemented biometric verification, CCTV monitoring, and incident reporting workflows to strengthen compliance across 12+ examination cycles.",
      "modified": "2025-10-01T11:21:41.056Z",
      "featured": false,
      "title": "Examination Integrity Monitoring",
      "tags": [
        "Biometric Verification",
        "CCTV Monitoring",
        "Compliance",
        "Incident Response",
        "Audit Trails"
      ],
      "link": "docs/case-studies/examination-integrity-monitoring.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "examination-integrity-monitoring",
      "image": "/img/Network-Security-&-Surveillance.png",
      "category": "systems",
      "posted": "2025-09-30T05:55:05.056Z"
    },
    {
      "details": [
        "Proposed and developed a security model adapting Capability-based Context Aware Access Control (CCAAC) for heterogeneous internet-enabled device environments, addressing authentication challenges in wireless communication topologies such as Wi-Fi and Long-Term Evolution (LTE) where unauthorized access, spoofing, and privilege escalation pose significant threats to device integrity and data confidentiality.",
        "Implemented the security model through TetherRemote, a custom-built web application enabling server-controller-client device pairing and remote management, using Apache and MySQL on a simulated server environment (XAMPP). As shown in Fig. 1, the TetherRemote dashboard provided administrators with a centralized overview of all registered devices — categorizing connected computers and smartphones, displaying their online/offline status, and serving as the primary interface for initiating device pairing, authorization, and management operations.",
        "Applied the Elliptic-Curve Diffie-Hellman (ECDH) algorithm for mutual device authentication, implementing secure key exchange where random prime number generation, public key encryption, and shared secret computation ensured that paired devices could cryptographically verify each other's identity before establishing trusted connections. Central to this process was the Capability structure illustrated in Fig. 2, where each device's Access Right was combined with its Device Identifier to form a capability token processed through the Identity and Capability-based Access Control Protocol (ICAP) — determining whether a subject device was authorized to access an object device based on context-aware policies.",
        "Designed a three-tier system architecture (Server, Controller, Client) where the server managed engine connectivity, device authorization, and pairing operations; smartphone controllers handled remote device management with assigned capability tokens and access rights (Read, Write, or NULL); and client machines processed authenticated instruction signals. Fig. 3 demonstrates the controller management interface, where administrators could view registered smartphone controllers, see their last-seen timestamps, and perform granular actions including assigning machines to controllers, viewing paired machines, configuring permissions, or revoking access — all governed by the capability-based access control policies enforcing least-privilege principles.",
        "Validated the CCAAC model against existing authentication solutions, demonstrating effectiveness against Denial of Service, Man-in-the-Middle, and Replay attacks. The Identity and Capability-based Access Control (IACAC) protocol achieved mutual authentication in 14.02ms — substantially outperforming competing schemes including IoT Auth (1,604ms) and HBQ (2,413ms) — while also addressing post-authentication access control that other schemes neglected.",
        "Documented the complete research methodology, system framework, and experimental validation results for academic peer review, culminating in publication in the Network and Communication Technologies journal (Vol. 5, No. 1, 2020, ISSN 1927-064X), contributing to the body of knowledge on IoT security and access control models for connected device environments.",
        "Work Context: This research and implementation work was completed during my FUTA tenure, where secure device access and policy enforcement were active operational concerns. Current Implementation: I continue applying the same access-control and secure-authentication principles in personal systems and automation projects."
      ],
      "impact": [
        {
          "value": "14ms",
          "label": "Auth latency",
          "detail": "IACAC mutual authentication"
        },
        {
          "value": "3",
          "label": "Attacks mitigated",
          "detail": "DoS, MITM, Replay"
        },
        {
          "value": "1",
          "label": "Published paper",
          "detail": "Peer-reviewed journal (CCSE, 2020)"
        }
      ],
      "summary": "Co-authored a peer-reviewed research paper published in the Network and Communication Technologies journal (Canadian Center of Science and Education, 2020), proposing a Capability-based Context Aware Access Control (CCAAC) security model for internet-enabled host devices, validated through a custom web application implementing Elliptic-Curve Diffie-Hellman mutual authentication.",
      "mobileSummary": "Co-authored a peer-reviewed paper proposing a CCAAC security model for IoT devices, validated through a custom web app using ECDH mutual authentication.",
      "linkText": "Read Published Paper (CCSE Journal)",
      "modified": "2025-10-26T20:06:00.000-04:00",
      "featured": true,
      "pdf": "docs/A-Secured-System-for-Internet-Enabled-Host-Devices.pdf",
      "title": "A Secured System for Internet-Enabled Host Devices",
      "images": [
        {
          "src": "/img/TetherRemote-Dashboard.png",
          "alt": "TetherRemote server dashboard showing 3 computers (all offline) and 1 smartphone, with sidebar navigation for Remote Devices, Device Feedback, and Administrator settings",
          "caption": "Fig. 1 — TetherRemote server dashboard: centralized device inventory displaying registered computers and smartphones with real-time connectivity status",
          "afterDetail": 1
        },
        {
          "src": "/img/Capability-Structure-Light.png",
          "srcDark": "/img/Capability-Structure-Dark.png",
          "alt": "Capability structure diagram showing how an Access Right combined with a Device Identifier forms a capability token processed through ICAP to authorize device-to-device access between Subject and Object devices",
          "caption": "Fig. 2 — Capability structure: an Access Right is paired with a Device Identifier and processed through ICAP to authorize inter-device access between subject and object endpoints",
          "afterDetail": 2
        },
        {
          "src": "/img/TetherRemote-Smartphone-Controller.png",
          "alt": "TetherRemote Smartphone Controller management page showing a registered Samsung Galaxy C9 Pro controller listed under its user-assigned connectivity name 'Rarebreed C9 Pro', with action dropdown for Assign Machines, View Machines, Permissions, and Delete",
          "caption": "Fig. 3 — Smartphone controller management: registered controllers with granular actions for machine assignment, permission configuration, and access revocation",
          "afterDetail": 3
        }
      ],
      "tags": [
        "Cybersecurity",
        "Access Control",
        "ECDH",
        "IoT Security",
        "Security Research"
      ],
      "link": "https://ccsenet.org/journal/index.php/nct/article/view/0/41982",
      "id": "secured-system-internet-enabled-host-devices",
      "published": true,
      "showRibbon": true,
      "ribbonText": "Published",
      "image": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "systems",
      "posted": "2019-06-12T16:00:00.000-04:00"
    },
    {
      "details": [
        "Developed Python ETL scripts to extract raw data from institutional source systems, business application exports, and MySQL databases, applying automated cleansing routines before loading reporting-ready datasets.",
        "Implemented quality assurance checkpoints within each pipeline stage — extraction validation, transformation rule verification, and output integrity checks — ensuring that data anomalies were caught and flagged before reports reached leadership, significantly reducing post-publication corrections.",
        "Standardized report templates and data visualizations across recurring deliverables including weekly KPI summaries, session progress updates, and variance analyses, eliminating the manual formatting and rework that previously consumed significant preparation time each reporting cycle.",
        "Delivered scheduled, automated reporting outputs that provided leadership with timely insights into admissions throughput, examination processing status, and results publication readiness across institutional workflows.",
        "Work Context: At FUTA (Systems & Data Analyst / System Programmer, 2017–2023), this pipeline pattern supported recurring admissions/examination reporting with tighter turnaround times. Current Implementation: I mirror the same production cadence in the scripting repository through `scripts/python/etl/etl_runner.py` and `scripts/workflow/schedule_daily_run.sh`, using config-driven runs and timestamped logs."
      ],
      "impact": [
        {
          "value": "8 hrs/week",
          "label": "Time saved",
          "detail": "Automation vs manual prep"
        },
        {
          "value": "40+",
          "label": "Reports generated",
          "detail": "Recurring leadership updates"
        },
        {
          "value": "100%",
          "label": "On-time delivery",
          "detail": "Scheduled pipeline runs"
        }
      ],
      "summary": "Designed and deployed automated Python/SQL pipelines that transformed recurring operational reporting from manual spreadsheets into scheduled, quality-checked workflows for leadership updates.",
      "mobileSummary": "Built Python and SQL pipelines that automated recurring reporting with scheduled, quality-checked outputs.",
      "modified": "2025-12-20T10:15:00.000Z",
      "featured": true,
      "title": "Operational Reporting Automation Pipeline",
      "tags": [
        "Python",
        "SQL",
        "Business Applications",
        "ETL Automation",
        "Reporting",
        "Workflow Automation",
        "Scheduled Jobs"
      ],
      "link": "docs/case-studies/operational-reporting-automation-pipeline.md",
      "linkText": "View Case Summary (Markdown)",
      "pdf": "docs/case-studies/operational-reporting-automation-pipeline.pdf",
      "id": "operational-reporting-automation-pipeline",
      "image": "https://images.unsplash.com/photo-1498050108023-c5249f4df085?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "automation",
      "posted": "2025-12-12T07:30:00.000Z"
    },
    {
      "details": [
        "Mapped incoming data from admissions modules, enrollment systems, and departmental results submissions to consistent student identifiers, highlighting mismatches across sources.",
        "Developed correction queues and status dashboards in Excel and Google Sheets that provided departmental coordinators with clear, actionable lists of records requiring verification, enabling distributed resolution of issues without disrupting the overall processing timeline.",
        "Partnered with department leads and academic coordinators to reconcile complex eligibility cases — including transfer students, readmission candidates, and students with incomplete records — ensuring that final published rosters accurately reflected each student's academic standing.",
        "Maintained lifecycle data integrity from initial application intake through graduation processing, applying SQL queries and formula-driven validation to ensure that records remained consistent and audit-ready across multiple academic sessions and reporting cycles.",
        "Work Context: At FUTA (Systems & Data Analyst / System Programmer, 2017–2023), this reconciliation flow aligned admissions, enrollment, and results records before publication windows. Current Implementation: I now keep the same source-vs-target checks in reusable assets (`scripts/python/reconciliation/reconcile_students.py` and `scripts/sql/templates/sql_reconciliation_diff_template.sql`) for consistent mismatch tracking."
      ],
      "impact": [
        {
          "value": "4,000+",
          "label": "Records reviewed",
          "detail": "Each academic cycle"
        },
        {
          "value": "1.2%",
          "label": "Duplicates flagged",
          "detail": "Resolved pre-publish"
        },
        {
          "value": "3",
          "label": "Source systems",
          "detail": "Admissions, enrollment, results"
        }
      ],
      "summary": "Built and operated a centralized records reconciliation process, cross-referencing admissions, enrollment, and results data to resolve duplicates, eligibility gaps, and mismatches before publication for 4,000+ records each cycle.",
      "mobileSummary": "Ran a centralized records reconciliation hub to resolve duplicates and eligibility gaps for 4,000+ records each cycle.",
      "modified": "2026-01-31T14:20:00.000Z",
      "featured": true,
      "title": "Student Records Reconciliation Hub",
      "tags": [
        "SQL",
        "Excel",
        "System Integration",
        "Data Validation",
        "Record Management",
        "Reconciliation",
        "Mismatch Reporting"
      ],
      "link": "docs/case-studies/student-records-reconciliation-hub.md",
      "linkText": "View Case Summary (Markdown)",
      "pdf": "docs/case-studies/student-records-reconciliation-hub.pdf",
      "id": "student-records-reconciliation-hub",
      "image": "https://images.unsplash.com/photo-1553877522-43269d4ea984?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "data",
      "posted": "2026-01-28T09:10:00.000Z"
    },
    {
      "details": [
        "Centralized examination readiness data from multiple operational streams — device inventory and compliance status, invigilation personnel assignments, venue preparation checklists, and technology setup verification — into a single unified dashboard providing real-time visibility into overall exam preparedness.",
        "Designed SLA threshold indicators and automated alerting logic to flag checkpoints at risk of breaching target deadlines, enabling operations leads to prioritize escalation actions and allocate resources to the most critical preparation gaps before each examination cycle.",
        "Produced daily SLA health snapshots shared with examination coordinators and operations leads, providing concise status summaries that highlighted items requiring immediate attention and tracking the resolution progress of previously flagged issues across 120+ tracked devices per cycle.",
        "Improved overall SLA adherence to About 95% by replacing ad-hoc tracking methods with a structured, metric-driven approach that established clear accountability for each readiness checkpoint and provided historical trend data to support continuous process improvement across examination operations.",
        "Work Context: At FUTA (Systems & Data Analyst / System Programmer, 2017–2023), this SLA tracking model was used to coordinate exam readiness and prioritize escalation for at-risk checkpoints. Current Implementation: I now preserve the same threshold logic in reusable assets (`scripts/python/reporting/sla_at_risk_report.py` with `data/sample/exam_tasks.csv`) to test queues before each exam window."
      ],
      "impact": [
        {
          "value": "95%",
          "label": "SLA adherence",
          "detail": "Improved monitoring"
        },
        {
          "value": "120+",
          "label": "Devices tracked",
          "detail": "Per cycle"
        },
        {
          "value": "6",
          "label": "Readiness checkpoints",
          "detail": "Daily SLA dashboard"
        }
      ],
      "summary": "Built a Power BI and Google Sheets-based SLA tracking system to centralize examination readiness monitoring across device compliance, invigilation staffing, and pre-exam preparation checkpoints, enabling operations teams to identify and escalate at-risk items before examination periods.",
      "mobileSummary": "Built a Power BI and Google Sheets SLA tracker that centralized exam readiness checkpoints and flagged at-risk items before each cycle.",
      "modified": "2026-02-03T10:30:00.000Z",
      "featured": true,
      "title": "Exam Operations SLA Tracker",
      "tags": [
        "Power BI",
        "Google Sheets",
        "SLA Tracking",
        "Operations",
        "Reporting",
        "At-Risk Alerts"
      ],
      "link": "docs/case-studies/exam-operations-sla-tracker.md",
      "linkText": "View Case Summary (Markdown)",
      "pdf": "docs/case-studies/exam-operations-sla-tracker.pdf",
      "id": "exam-operations-sla-tracker",
      "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "data",
      "posted": "2026-02-02T14:20:00.000Z"
    },
    {
      "details": [
        "Defined structured testing gates, compatibility verification steps, and rollback procedures for each phase of software and system deployments, ensuring that new installations were validated against baseline requirements before being released to production or classroom environments.",
        "Developed step-by-step QA scripts covering pre-deployment environment checks, installation verification, post-deployment functional testing, and user acceptance criteria, reducing the likelihood of configuration drift and inconsistent setups across multiple machines.",
        "Aligned documentation standards with institutional procedures so that support staff and instructors could execute repeatable installations independently, following consistent handoff checklists that captured configuration details, version information, and known-issue workarounds.",
        "Maintained a living library of deployment playbooks covering common scenarios — including development tool installation (Eclipse, VS Code, MySQL), operating system configuration, virtual machine setup, and network service provisioning — with version tracking to keep procedures current as software updates were released.",
        "Work Context: Across FUTA (2017–2023) and Pures College (2024–2025), these implementation and QA playbooks were used to stabilize rollouts and reduce configuration drift across teams. Current Implementation: I continue maintaining the same checklist-first model in personal projects to keep deployments repeatable and auditable."
      ],
      "impact": [
        {
          "value": "30+",
          "label": "Deployments standardized",
          "detail": "Checklist-driven rollouts"
        },
        {
          "value": "15%",
          "label": "Faster setup",
          "detail": "Reduced repeat troubleshooting"
        },
        {
          "value": "6",
          "label": "Playbooks",
          "detail": "Install, QA, rollback, and docs"
        }
      ],
      "summary": "Created comprehensive implementation checklists, quality assurance scripts, and standardized documentation to bring consistency and repeatability to software rollouts, lab environment provisioning, and technical deployment workflows across classroom and examination environments.",
      "mobileSummary": "Created implementation checklists and QA scripts that standardized software rollouts and lab deployments across classrooms and exams.",
      "modified": "2025-09-29T12:21:50.056Z",
      "featured": true,
      "title": "Systems Implementation & QA Playbooks",
      "tags": [
        "Documentation",
        "QA Support",
        "Implementation",
        "Process Improvement",
        "Change Management"
      ],
      "link": "docs/case-studies/systems-implementation-qa-playbooks.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "systems-implementation-qa-playbooks",
      "image": "/img/Cloud-Migration-Tool.png",
      "category": "systems",
      "posted": "2025-09-29T02:11:14.056Z"
    },
    {
      "details": [
        "Configured multi-branch network topologies simulating enterprise WAN connectivity, including static routing paths for predictable traffic patterns and dynamic routing protocol scenarios that demonstrated how networks adapt to link failures and topology changes in production environments.",
        "Implemented VPN tunnel configurations across isolated network segments, practicing split-tunnel, full-tunnel, and failover scenarios to understand how encrypted connectivity is established and maintained between geographically separated sites.",
        "Captured detailed troubleshooting logs, packet traces, and failover behavior records for each lab scenario, building a documented reference library of common routing and VPN issues along with validated resolution steps for repeatable lab exercises.",
        "Bridged theoretical networking concepts with practical implementation by systematically working through real-world scenarios such as routing table convergence, asymmetric path detection, and VPN re-establishment after link failures, using both Packet Tracer simulations and physical lab equipment.",
        "Work Context: At Pures College (Computer IT Instructor, 2024–2025), I used these routing and VPN exercises to guide learners through structured troubleshooting and network behavior analysis. Current Implementation: I continue extending these scenarios in my personal lab to test failover handling and connectivity recovery patterns."
      ],
      "impact": [
        {
          "value": "5",
          "label": "Site links",
          "detail": "Simulated branch network"
        },
        {
          "value": "2",
          "label": "Routing modes",
          "detail": "Static and dynamic"
        },
        {
          "value": "4",
          "label": "VPN scenarios",
          "detail": "Split, full, failover, fallback"
        }
      ],
      "summary": "Designed and operated a multi-site network simulation lab to practice routing fundamentals, VPN tunnel configuration, and connectivity troubleshooting, reinforcing Cisco networking concepts through hands-on experimentation with both static and dynamic routing protocols.",
      "mobileSummary": "Ran a multi-site routing and VPN lab to practice connectivity design, failover behavior, and troubleshooting workflows.",
      "modified": "2025-10-04T05:25:37.056Z",
      "featured": false,
      "title": "Routing & VPN Basics Lab",
      "tags": [
        "Routing",
        "VPN Basics",
        "TCP/IP",
        "Troubleshooting",
        "Network Design"
      ],
      "link": "docs/case-studies/routing-vpn-basics-lab.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "routing-vpn-basics-lab",
      "image": "/img/WAN-Simulation-with-SD-WAN.png",
      "category": "networking",
      "posted": "2025-09-26T05:01:44.056Z"
    },
    {
      "details": [
        "Built forward and reverse DNS lookup zones with properly configured records (A, AAAA, PTR, CNAME, MX), establishing reliable name resolution services that client machines across multiple VLANs could use for both internal resource discovery and external connectivity.",
        "Configured DHCP server scopes with appropriate address ranges, lease durations, and reservation policies to provide automated IP assignment for 50+ mixed client devices, including both Windows and Linux systems operating across different network segments.",
        "Validated DHCP lease lifecycle behavior including initial allocation, renewal timing, and failover scenarios, documenting the troubleshooting steps for common issues such as IP conflicts, scope exhaustion, and relay agent misconfiguration in multi-segment environments.",
        "Tested cross-platform client connectivity to ensure consistent DNS resolution and DHCP address acquisition across Windows and Linux operating systems, verifying that network services functioned correctly regardless of client platform and documenting platform-specific configuration requirements.",
        "Work Context: At Pures College (Computer IT Instructor, 2024–2025), this DNS/DHCP workflow supported practical networking lessons on name resolution, lease behavior, and service troubleshooting. Current Implementation: I continue validating the same service patterns in my personal lab across segmented environments."
      ],
      "impact": [
        {
          "value": "50+",
          "label": "Leases managed",
          "detail": "Mixed client devices"
        },
        {
          "value": "2",
          "label": "DNS zones",
          "detail": "Forward and reverse"
        },
        {
          "value": "3",
          "label": "Client OS",
          "detail": "Windows, Linux, VM lab"
        }
      ],
      "summary": "Configured and validated DNS and DHCP infrastructure services in a mixed Windows and Linux lab environment, building foundational network service skills for reliable name resolution, automated IP address management, and cross-platform client connectivity troubleshooting.",
      "mobileSummary": "Configured DNS and DHCP lab services to validate name resolution, lease management, and cross-platform connectivity.",
      "modified": "2025-09-19T05:44:00.056Z",
      "featured": false,
      "title": "DNS & DHCP Services Lab",
      "tags": [
        "DNS",
        "DHCP",
        "Windows",
        "Linux",
        "Network Services"
      ],
      "link": "docs/case-studies/dns-dhcp-services-lab.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "dns-dhcp-services-lab",
      "image": "https://images.unsplash.com/photo-1629654297299-c8506221ca97?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "networking",
      "posted": "2025-09-19T05:44:05.056Z"
    },
    {
      "details": [
        "Conducted comprehensive pre-examination readiness assessments covering operating system patch levels, antivirus definition currency, application version compliance, and hardware functionality across laptops and desktop systems used in examination environments.",
        "Tracked remediation status for identified deficiencies using structured checklists and status dashboards, coordinating with IT support teams to prioritize and resolve critical issues within a 24-hour turnaround target before examination commencement.",
        "Verified security baseline adherence including user account configurations, access control settings, and network connectivity requirements to ensure that examination systems met institutional security standards and could not be exploited for unauthorized activities during testing periods.",
        "Logged detailed readiness outcomes and compliance status reports for each examination cycle, building historical records that supported trend analysis, resource planning, and continuous improvement of the pre-exam technology verification process.",
        "Work Context: At FUTA (Systems & Data Analyst / System Programmer, 2017–2023), this readiness process was used before high-stakes examinations to enforce baseline compliance and rapid issue resolution. Current Implementation: I continue applying the same pre-flight verification model in personal operations checklists and lab maintenance routines."
      ],
      "impact": [
        {
          "value": "150+",
          "label": "Devices checked",
          "detail": "Per exam cycle"
        },
        {
          "value": "98%",
          "label": "Compliance rate",
          "detail": "Pre-exam verification"
        },
        {
          "value": "24 hrs",
          "label": "Issue turnaround",
          "detail": "Readiness remediation"
        }
      ],
      "summary": "Performed systematic preventative maintenance and operational readiness verification on examination technology infrastructure before high-stakes testing periods at a federal university, ensuring device compliance, software currency, and security baseline adherence across 150+ systems each exam cycle.",
      "mobileSummary": "Ran pre-exam readiness checks across 150+ devices to verify compliance, patch status, and operational reliability.",
      "modified": "2025-11-27T15:40:00.000Z",
      "featured": false,
      "title": "Operational Readiness Checks",
      "tags": [
        "Preventative Maintenance",
        "Compliance",
        "Windows Support",
        "Troubleshooting",
        "Operations"
      ],
      "link": "docs/case-studies/operational-readiness-checks.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "operational-readiness-checks",
      "image": "https://images.unsplash.com/photo-1558494949-ef010cbdcc31?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "systems",
      "posted": "2025-11-20T09:05:00.000Z"
    },
    {
      "details": [
        "Authored detailed step-by-step installation guides, configuration runbooks, and quick-reference materials covering common system administration tasks, software deployment procedures, and troubleshooting workflows used by support staff and instructors across classroom and examination environments.",
        "Facilitated hands-on training workshops for technical and non-technical staff, translating complex system workflows into practical, actionable instructions and ensuring alignment on standard operating procedures, escalation paths, and documentation expectations across teams.",
        "Maintained a centralized knowledge base of documented solutions, known issues, and configuration templates that reduced repeat support tickets by providing staff with self-service access to verified resolution steps for frequently encountered problems.",
        "Developed onboarding documentation packages for new team members covering system access procedures, tool configurations, institutional workflows, and key contacts, enabling faster ramp-up and consistent adherence to operational standards from day one.",
        "Work Context: At FUTA and Pures College, these documentation assets were central to onboarding, support consistency, and smoother handoffs between technical teams. Current Implementation: I keep building the same runbook-first approach in personal projects to preserve repeatable setup and troubleshooting workflows."
      ],
      "impact": [
        {
          "value": "12",
          "label": "Guides delivered",
          "detail": "SOPs and runbooks"
        },
        {
          "value": "6",
          "label": "Workshops led",
          "detail": "Team onboarding sessions"
        },
        {
          "value": "100+",
          "label": "Users supported",
          "detail": "Staff and students"
        }
      ],
      "summary": "Produced comprehensive standard operating procedures, technical runbooks, and hands-on training materials to support system rollouts, troubleshooting workflows, and staff onboarding across academic IT environments, directly reducing support ticket volume and accelerating new team member productivity.",
      "mobileSummary": "Produced SOPs, runbooks, and training materials that streamlined system rollouts and reduced repeat support tickets.",
      "modified": "2025-09-14T05:15:24.056Z",
      "featured": true,
      "title": "Technical Documentation & End-User Training",
      "tags": [
        "Documentation",
        "End-User Training",
        "Stakeholder Communication",
        "Process Improvement",
        "Knowledge Base"
      ],
      "link": "docs/case-studies/technical-documentation-end-user-training.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "technical-documentation-end-user-training",
      "image": "https://images.unsplash.com/photo-1512314889357-e157c22f938d?auto=format&fit=crop&w=680&h=384&q=80",
      "category": "systems",
      "posted": "2025-09-14T05:15:24.056Z"
    },
    {
      "details": [
        "Diagnosed and resolved a diverse range of technical issues including hardware failures, OS boot and configuration problems, application installation errors, network connectivity issues, and peripheral device malfunctions across Windows and Linux platforms used in classroom and examination settings.",
        "Built and maintained a known-issues knowledge base documenting recurring problems, root cause analyses, and validated resolution steps, enabling faster incident resolution and reducing escalation rates for common support scenarios encountered across multiple academic terms.",
        "Tracked all support requests with detailed incident logs capturing symptoms, diagnostic steps taken, resolution actions, and time-to-resolution metrics, maintaining About 95% SLA compliance for response and resolution targets across multiple academic terms and examination cycles.",
        "Escalated critical incidents through established channels with comprehensive documentation of troubleshooting steps already attempted, enabling senior support teams to quickly assess the situation and implement fixes while prevention recommendations were documented to reduce future recurrence.",
        "Work Context: At FUTA and Pures College, this incident-response workflow supported day-to-day system stability with structured diagnostics, logging, and escalation discipline. Current Implementation: I continue using the same root-cause and knowledge-base pattern in personal support workflows and lab operations."
      ],
      "impact": [
        {
          "value": "200+",
          "label": "Incidents resolved",
          "detail": "Tracked support requests"
        },
        {
          "value": "95%",
          "label": "SLA compliance",
          "detail": "Response and resolution"
        },
        {
          "value": "1",
          "label": "Knowledge base",
          "detail": "Documented recurring fixes"
        }
      ],
      "summary": "Provided frontline Windows and Linux systems support across academic IT environments, diagnosing and resolving hardware, operating system, and application issues while maintaining structured incident documentation and SLA compliance for 200+ tracked support requests.",
      "mobileSummary": "Delivered frontline Windows and Linux support, resolving hardware and OS issues while maintaining detailed incident logs and SLA compliance.",
      "modified": "2025-09-12T17:36:32.056Z",
      "featured": true,
      "title": "Systems Support & Troubleshooting",
      "tags": [
        "Systems Support",
        "Troubleshooting",
        "Windows",
        "Linux",
        "Service Desk"
      ],
      "link": "docs/case-studies/systems-support-troubleshooting.md",
      "linkText": "View Case Summary (Markdown)",
      "id": "systems-support-troubleshooting",
      "image": "/img/PuTTy-2.png",
      "category": "systems",
      "posted": "2025-09-06T05:25:18.056Z"
    }
  ]
}
